In [1]:
import numpy as np
import pandas as pd
s1 = pd.Series([0,1], index=['a','b'])
display(s1)
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
display(s2)
s3 = pd.Series([5, 6], index=['f', 'g'])
display(s3)

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [2]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [3]:
pd.concat([s1, s2, s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [4]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
                   index=['a', 'b', 'c'],
                   columns=['one','two'])
display(df1)
df2 = pd.DataFrame(np.arange(4).reshape(2, 2),
                   index=['a', 'c'],
                   columns=['three','four'])
display(df2)

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      0     1
c      2     3

In [5]:
pd.concat([df1, df2],axis=1)

   one  two  three  four
a    0    1    0.0   1.0
b    2    3    NaN   NaN
c    4    5    2.0   3.0

In [6]:
pd.concat([df1, df2],axis=1,keys=['台北','台南'])

   台北        台南
  one two three four
a   0   1   0.0  1.0
b   2   3   NaN  NaN
c   4   5   2.0  3.0

In [7]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
display(df1)
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
display(df2)

pd.concat([df1,df2])

          a         b         c         d
0 -0.556275  0.082615 -0.414178  0.009733
1  1.393859  0.207465 -0.458518 -0.134624
2 -1.328263  3.369988 -0.041984 -1.279139

          b         d         a
0  1.167674  0.852082  1.115563
1  0.023399  0.841790  0.756807

          a         b         c         d
0 -0.556275  0.082615 -0.414178  0.009733
1  1.393859  0.207465 -0.458518 -0.134624
2 -1.328263  3.369988 -0.041984 -1.279139
0  1.115563  1.167674       NaN  0.852082
1  0.756807  0.023399       NaN  0.841790

In [8]:
pd.concat([df1,df2],ignore_index=True)

          a         b         c         d
0 -0.556275  0.082615 -0.414178  0.009733
1  1.393859  0.207465 -0.458518 -0.134624
2 -1.328263  3.369988 -0.041984 -1.279139
3  1.115563  1.167674       NaN  0.852082
4  0.756807  0.023399       NaN  0.841790

In [9]:
import yfinance as yf
data = yf.download("2330.TW", start="2022-01-01",end="2022-12-31")
tw2330 = data[['Adj Close']]
tw2330.columns = ['台積電']
tw2330

[*********************100%%**********************]  1 of 1 completed

                   台積電
Date
2022-01-03  607.793213
2022-01-04  631.873779
2022-01-05  626.094360
2022-01-06  620.315063
2022-01-07  610.682922
...                ...
2022-12-26  449.421265
2022-12-27  449.913513
2022-12-28  444.006531
2022-12-29  439.084076
2022-12-30  441.545288

[246 rows x 1 columns]

In [10]:
data = yf.download("2303.TW", start="2022-01-01",end="2022-12-31")
tw2303 = data[['Adj Close']]
tw2303.columns = ['聯電']
tw2303

[*********************100%%**********************]  1 of 1 completed

                   聯電
Date
2022-01-03  55.519875
2022-01-04  55.169590
2022-01-05  55.257160
2022-01-06  54.906879
2022-01-07  54.819305
...               ...
2022-12-26  39.069618
2022-12-27  39.022995
2022-12-28  38.043922
2022-12-29  37.997299
2022-12-30  37.950680

[246 rows x 1 columns]

In [11]:
pd.concat([tw2330,tw2303],axis=1)

                   台積電         聯電
Date
2022-01-03  607.793213  55.519875
2022-01-04  631.873779  55.169590
2022-01-05  626.094360  55.257160
2022-01-06  620.315063  54.906879
2022-01-07  610.682922  54.819305
...                ...        ...
2022-12-26  449.421265  39.069618
2022-12-27  449.913513  39.022995
2022-12-28  444.006531  38.043922
2022-12-29  439.084076  37.997299
2022-12-30  441.545288  37.950680

[246 rows x 2 columns]